[Survived] BooleanLiteral
malicious-updates-icse2021/permsystem/src/lib.js:8:18
 var fs = require('fs');
 
 var nodesbox = {};
-nodesbox.debug = false;
+nodesbox.debug = true;
 nodesbox.ast = {};
 nodesbox.scopeManager = {};

[Survived] ArrayDeclaration
malicious-updates-icse2021/permsystem/src/lib.js:12:36
 nodesbox.ast = {};
 nodesbox.scopeManager = {};
 nodesbox.currentScope = {};
-nodesbox.globalImplicitVariables = [];
+nodesbox.globalImplicitVariables = ["Stryker was here"];
 
 nodesbox.generateRandomPropertyEnforcementFunctionName = function() { return "$prop" + Math.random().toString(36).substring(2, 15); }

[Survived] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:14:69
 nodesbox.currentScope = {};
 nodesbox.globalImplicitVariables = [];
 
-nodesbox.generateRandomPropertyEnforcementFunctionName = function() { return "$prop" + Math.random().toString(36).substring(2, 15); }
+nodesbox.generateRandomPropertyEnforcementFunctionName = function() {}
 
 const internalObjectKeys = ['start', 'end', 'parent', 'arguments', 'type'];

[Survived] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:16:55
 
 nodesbox.generateRandomPropertyEnforcementFunctionName = function() { return "$prop" + Math.random().toString(36).substring(2, 15); }
 
-const internalObjectKeys = ['start', 'end', 'parent', 'arguments', 'type'];
+const internalObjectKeys = ['start', 'end', 'parent', "", 'type'];
 
 nodesbox.blacklistedLocalObjects = ["module", "global", "require"];

[Survived] ArrayDeclaration
malicious-updates-icse2021/permsystem/src/lib.js:16:28
 
 nodesbox.generateRandomPropertyEnforcementFunctionName = function() { return "$prop" + Math.random().toString(36).substring(2, 15); }
 
-const internalObjectKeys = ['start', 'end', 'parent', 'arguments', 'type'];
+const internalObjectKeys = [];
 
 nodesbox.blacklistedLocalObjects = ["module", "global", "require"];

[Survived] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:18:47
 
 const internalObjectKeys = ['start', 'end', 'parent', 'arguments', 'type'];
 
-nodesbox.blacklistedLocalObjects = ["module", "global", "require"];
+nodesbox.blacklistedLocalObjects = ["module", "", "require"];
 nodesbox.blacklistedObjects = nodesbox.blacklistedLocalObjects.concat(nodesbox.nativeObjectNames);
 

[Killed] ArrayDeclaration
malicious-updates-icse2021/permsystem/src/lib.js:21:30
 nodesbox.blacklistedLocalObjects = ["module", "global", "require"];
 nodesbox.blacklistedObjects = nodesbox.blacklistedLocalObjects.concat(nodesbox.nativeObjectNames);
 
-nodesbox.nativeObjectNames = ["JSON", "Buffer", "Date", "Math", "String", "Boolean", "Number", "Array", "Object", "Reflect", "RegExp", "Map", "WeakMap", "Promise", "Proxy", "Set"];
+nodesbox.nativeObjectNames = [];
 
 nodesbox.localVariables = nodesbox.nativeObjectNames.concat(["self", "window", "require", "module", "global", "GLOBAL", "root", "exports", "__filename", "__dirname"]);

[Survived] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:21:115
 nodesbox.blacklistedLocalObjects = ["module", "global", "require"];
 nodesbox.blacklistedObjects = nodesbox.blacklistedLocalObjects.concat(nodesbox.nativeObjectNames);
 
-nodesbox.nativeObjectNames = ["JSON", "Buffer", "Date", "Math", "String", "Boolean", "Number", "Array", "Object", "Reflect", "RegExp", "Map", "WeakMap", "Promise", "Proxy", "Set"];
+nodesbox.nativeObjectNames = ["JSON", "Buffer", "Date", "Math", "String", "Boolean", "Number", "Array", "Object", "", "RegExp", "Map", "WeakMap", "Promise", "Proxy", "Set"];
 
 nodesbox.localVariables = nodesbox.nativeObjectNames.concat(["self", "window", "require", "module", "global", "GLOBAL", "root", "exports", "__filename", "__dirname"]);

[Killed] ArrayDeclaration
malicious-updates-icse2021/permsystem/src/lib.js:23:61
 
 nodesbox.nativeObjectNames = ["JSON", "Buffer", "Date", "Math", "String", "Boolean", "Number", "Array", "Object", "Reflect", "RegExp", "Map", "WeakMap", "Promise", "Proxy", "Set"];
 
-nodesbox.localVariables = nodesbox.nativeObjectNames.concat(["self", "window", "require", "module", "global", "GLOBAL", "root", "exports", "__filename", "__dirname"]);
+nodesbox.localVariables = nodesbox.nativeObjectNames.concat([]);
 

[Killed] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:23:80
 
 nodesbox.nativeObjectNames = ["JSON", "Buffer", "Date", "Math", "String", "Boolean", "Number", "Array", "Object", "Reflect", "RegExp", "Map", "WeakMap", "Promise", "Proxy", "Set"];
 
-nodesbox.localVariables = nodesbox.nativeObjectNames.concat(["self", "window", "require", "module", "global", "GLOBAL", "root", "exports", "__filename", "__dirname"]);
+nodesbox.localVariables = nodesbox.nativeObjectNames.concat(["self", "window", "", "module", "global", "GLOBAL", "root", "exports", "__filename", "__dirname"]);
 

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:27:58
 
 
-nodesbox.isBlacklistedProperty = function (propertyName) {
-    return nodesbox.blacklistedProperties.indexOf(propertyName) > -1;
-}
+nodesbox.isBlacklistedProperty = function (propertyName) {}
 nodesbox.includePropertyEnforcementFunction = function(code, propCheckFunctionName) {
     code = code.substring(code.indexOf("\n"));

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:28:12
 
 nodesbox.isBlacklistedProperty = function (propertyName) {
-    return nodesbox.blacklistedProperties.indexOf(propertyName) > -1;
+    return true;
 }
 nodesbox.includePropertyEnforcementFunction = function(code, propCheckFunctionName) {

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:28:12
 
 nodesbox.isBlacklistedProperty = function (propertyName) {
-    return nodesbox.blacklistedProperties.indexOf(propertyName) > -1;
+    return false;
 }
 nodesbox.includePropertyEnforcementFunction = function(code, propCheckFunctionName) {

[NoCoverage] UnaryOperator
malicious-updates-icse2021/permsystem/src/lib.js:32:51
 }
 nodesbox.includePropertyEnforcementFunction = function(code, propCheckFunctionName) {
     code = code.substring(code.indexOf("\n"));
-    code = code.substring(code.lastIndexOf("\n"), -1);
+    code = code.substring(code.lastIndexOf("\n"), +1);
     var prop = "\r\n   var blacklisted = {};\r\n   blacklisted[\"parent\"] = module;\r\n   blacklisted[\"children\"] = module;\r\n   blacklisted[\"require\"] = module;\r\n   " +
         "blacklisted[\"main\"] = require;\r\n   blacklisted[\"paths\"] = module;\r\n   blacklisted[\"globalPaths\"] = module;\r\n   blacklisted[\"eval\"] = global;\r\n   " +

[NoCoverage] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:35:9
     code = code.substring(code.lastIndexOf("\n"), -1);
     var prop = "\r\n   var blacklisted = {};\r\n   blacklisted[\"parent\"] = module;\r\n   blacklisted[\"children\"] = module;\r\n   blacklisted[\"require\"] = module;\r\n   " +
         "blacklisted[\"main\"] = require;\r\n   blacklisted[\"paths\"] = module;\r\n   blacklisted[\"globalPaths\"] = module;\r\n   blacklisted[\"eval\"] = global;\r\n   " +
-        "blacklisted[\"process\"] = global;\r\n   blacklisted[\"prototype\"] = Object;\r\n   blacklisted[\"Function\"] = global;\r\n   \r\n   \/\/" +
+        "" +
         " checks permissions to access properties\r\n function " + propCheckFunctionName + "(obj, p) {\r\n if (obj == undefined) return undefined;\r\n if (p == undefined) return undefined;\r\n" +

[NoCoverage] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:39:19
         " checks permissions to access properties\r\n function " + propCheckFunctionName + "(obj, p) {\r\n if (obj == undefined) return undefined;\r\n if (p == undefined) return undefined;\r\n" +
 
-    return prop + "\n" + code;
+    return prop + "" + code;
 }
 

[Killed] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:43:5
 }
 
 nodesbox.wrapper = [
-    '(function (exports, require, module, __filename, __dirname) {\n',
+    "",
     '\n});'
 ];

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:47:35
     '\n});'
 ];
 
-nodesbox.wrap = function (script) {
-    return nodesbox.wrapper[0] + script + nodesbox.wrapper[1];
-};
+nodesbox.wrap = function (script) {};
 
 nodesbox.rewrite = function(input) {

[Killed] ArithmeticOperator
malicious-updates-icse2021/permsystem/src/lib.js:48:12
 ];
 
 nodesbox.wrap = function (script) {
-    return nodesbox.wrapper[0] + script + nodesbox.wrapper[1];
+    return nodesbox.wrapper[0] + script - nodesbox.wrapper[1];
 };
 

[Killed] ArithmeticOperator
malicious-updates-icse2021/permsystem/src/lib.js:48:12
 ];
 
 nodesbox.wrap = function (script) {
-    return nodesbox.wrapper[0] + script + nodesbox.wrapper[1];
+    return nodesbox.wrapper[0] - script + nodesbox.wrapper[1];
 };
 

[NoCoverage] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:51:36
     return nodesbox.wrapper[0] + script + nodesbox.wrapper[1];
 };
 
-nodesbox.rewrite = function(input) {
-    var AST = nodesbox.parse(nodesbox.wrap(input));
-    var scopeManager = nodesbox.getScopeManager(AST);
-    var propertyEnforcementFunctionName = nodesbox.generateRandomPropertyEnforcementFunctionName();
-
-    var resultAST = nodesbox.normalizeVariablesScope(AST, scopeManager);
-    resultAST = nodesbox.normalizeMemberExpr(AST);
-    resultAST = nodesbox.rewriteMemberExpr(resultAST, propertyEnforcementFunctionName);
-
-    var code = nodesbox.genCode(resultAST);
-    return nodesbox.wrap(nodesbox.includePropertyEnforcementFunction(code, propertyEnforcementFunctionName));
-}
+nodesbox.rewrite = function(input) {}
 
 nodesbox.readFile = function(fileName) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:64:40
     return nodesbox.wrap(nodesbox.includePropertyEnforcementFunction(code, propertyEnforcementFunctionName));
 }
 
-nodesbox.readFile = function(fileName) {
-    var content = fs.readFileSync(fileName, 'utf8');
-    return content;
-}
+nodesbox.readFile = function(fileName) {}
 
 nodesbox.writeFile = function(fileName, content) {

[NoCoverage] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:69:50
     return content;
 }
 
-nodesbox.writeFile = function(fileName, content) {
-    let stream;
-    if (fileName) stream = fs.createWriteStream(fileName);
-    else stream = process.stdout;
-    stream.write(content,'utf8');
-    stream.end();
-}
+nodesbox.writeFile = function(fileName, content) {}
 
 nodesbox.parse = function(code) {

[NoCoverage] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:71:9
 
 nodesbox.writeFile = function(fileName, content) {
     let stream;
-    if (fileName) stream = fs.createWriteStream(fileName);
+    if (true) stream = fs.createWriteStream(fileName);
     else stream = process.stdout;
     stream.write(content,'utf8');

[NoCoverage] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:71:9
 
 nodesbox.writeFile = function(fileName, content) {
     let stream;
-    if (fileName) stream = fs.createWriteStream(fileName);
+    if (false) stream = fs.createWriteStream(fileName);
     else stream = process.stdout;
     stream.write(content,'utf8');

[NoCoverage] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:73:26
     let stream;
     if (fileName) stream = fs.createWriteStream(fileName);
     else stream = process.stdout;
-    stream.write(content,'utf8');
+    stream.write(content,"");
     stream.end();
 }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:77:33
     stream.end();
 }
 
-nodesbox.parse = function(code) {
-    try {
-    var ast = espree.parse(code, { ecmaVersion: 6 });
-    } catch(e) {
-        console.error("Error when parsing JavaScript code");
-        throw e;
-    }
-    nodesbox.visitAST(ast, function(){});
-    nodesbox.disableLeftSideRewrite(ast);
-    return ast;
-}
+nodesbox.parse = function(code) {}
 
 nodesbox.getScopeManager = function(ast) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:78:9
 }
 
 nodesbox.parse = function(code) {
-    try {
-    var ast = espree.parse(code, { ecmaVersion: 6 });
-    } catch(e) {
+    try {} catch(e) {
         console.error("Error when parsing JavaScript code");
         throw e;

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:80:16
 nodesbox.parse = function(code) {
     try {
     var ast = espree.parse(code, { ecmaVersion: 6 });
-    } catch(e) {
-        console.error("Error when parsing JavaScript code");
-        throw e;
-    }
+    } catch(e) {}
     nodesbox.visitAST(ast, function(){});
     nodesbox.disableLeftSideRewrite(ast);

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:89:42
     return ast;
 }
 
-nodesbox.getScopeManager = function(ast) {
-    var sm = escope.analyze(ast);
-    nodesbox.scopeManager = sm;
-    return sm;
-}
+nodesbox.getScopeManager = function(ast) {}
 
 nodesbox.disableLeftSideRewrite = function(ast) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:95:49
     return sm;
 }
 
-nodesbox.disableLeftSideRewrite = function(ast) {
-    estraverse.traverse(ast, {
-        enter: function(node) {
-            if (node.type == 'AssignmentExpression') {
-                node.left.doNotRewrite = true;
-            }
-            if (node.type == 'VariableDeclarator') {
-                node.id.doNotRewrite = true;
-            }
-        }
-    });
-}
+nodesbox.disableLeftSideRewrite = function(ast) {}
 
 nodesbox.visitAST = function(ast, visit) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:97:31
 
 nodesbox.disableLeftSideRewrite = function(ast) {
     estraverse.traverse(ast, {
-        enter: function(node) {
-            if (node.type == 'AssignmentExpression') {
-                node.left.doNotRewrite = true;
-            }
-            if (node.type == 'VariableDeclarator') {
-                node.id.doNotRewrite = true;
-            }
-        }
+        enter: function(node) {}
     });
 }

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:98:17
 nodesbox.disableLeftSideRewrite = function(ast) {
     estraverse.traverse(ast, {
         enter: function(node) {
-            if (node.type == 'AssignmentExpression') {
+            if (false) {
                 node.left.doNotRewrite = true;
             }

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:98:17
 nodesbox.disableLeftSideRewrite = function(ast) {
     estraverse.traverse(ast, {
         enter: function(node) {
-            if (node.type == 'AssignmentExpression') {
+            if (true) {
                 node.left.doNotRewrite = true;
             }

[Killed] BooleanLiteral
malicious-updates-icse2021/permsystem/src/lib.js:99:42
     estraverse.traverse(ast, {
         enter: function(node) {
             if (node.type == 'AssignmentExpression') {
-                node.left.doNotRewrite = true;
+                node.left.doNotRewrite = false;
             }
             if (node.type == 'VariableDeclarator') {

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:101:17
             if (node.type == 'AssignmentExpression') {
                 node.left.doNotRewrite = true;
             }
-            if (node.type == 'VariableDeclarator') {
+            if (node.type != 'VariableDeclarator') {
                 node.id.doNotRewrite = true;
             }

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:101:17
             if (node.type == 'AssignmentExpression') {
                 node.left.doNotRewrite = true;
             }
-            if (node.type == 'VariableDeclarator') {
+            if (false) {
                 node.id.doNotRewrite = true;
             }

[Killed] BooleanLiteral
malicious-updates-icse2021/permsystem/src/lib.js:102:40
                 node.left.doNotRewrite = true;
             }
             if (node.type == 'VariableDeclarator') {
-                node.id.doNotRewrite = true;
+                node.id.doNotRewrite = false;
             }
         }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:108:42
     });
 }
 
-nodesbox.visitAST = function(ast, visit) {
-    estraverse.traverse(ast, {
-        enter: function(node, parent) {
-            node.parent = parent;
-            visit(node);
-        }
-    });
-}
+nodesbox.visitAST = function(ast, visit) {}
 
 nodesbox.getReferences = function(scope) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:110:39
 
 nodesbox.visitAST = function(ast, visit) {
     estraverse.traverse(ast, {
-        enter: function(node, parent) {
-            node.parent = parent;
-            visit(node);
-        }
+        enter: function(node, parent) {}
     });
 }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:117:42
     });
 }
 
-nodesbox.getReferences = function(scope) {
-    var refs = [];
-    for (var i = 0; i < scope.references.length; i++) {
-        refs.push(scope.references[i]);
-    }
-    return refs;
-}
+nodesbox.getReferences = function(scope) {}
 
 nodesbox.getVariables = function(scope) {

[Killed] ArrayDeclaration
malicious-updates-icse2021/permsystem/src/lib.js:118:16
 }
 
 nodesbox.getReferences = function(scope) {
-    var refs = [];
+    var refs = ["Stryker was here"];
     for (var i = 0; i < scope.references.length; i++) {
         refs.push(scope.references[i]);

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:119:55
 
 nodesbox.getReferences = function(scope) {
     var refs = [];
-    for (var i = 0; i < scope.references.length; i++) {
-        refs.push(scope.references[i]);
-    }
+    for (var i = 0; i < scope.references.length; i++) {}
     return refs;
 }

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:119:21
 
 nodesbox.getReferences = function(scope) {
     var refs = [];
-    for (var i = 0; i < scope.references.length; i++) {
+    for (var i = 0; i <= scope.references.length; i++) {
         refs.push(scope.references[i]);
     }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:125:41
     return refs;
 }
 
-nodesbox.getVariables = function(scope) {
-    var vars = [];
-    if (!scope || !scope.variables) return vars;
-
-    for (var i = 0; i < scope.variables.length; i++) {
-        vars.push(scope.variables[i]);
-    }
-    return vars;
-}
+nodesbox.getVariables = function(scope) {}
 
 nodesbox.getVariablesFromUpperScopes = function(scope) {

[Survived] ArrayDeclaration
malicious-updates-icse2021/permsystem/src/lib.js:126:16
 }
 
 nodesbox.getVariables = function(scope) {
-    var vars = [];
+    var vars = ["Stryker was here"];
     if (!scope || !scope.variables) return vars;
 

[Killed] LogicalOperator
malicious-updates-icse2021/permsystem/src/lib.js:127:9
 
 nodesbox.getVariables = function(scope) {
     var vars = [];
-    if (!scope || !scope.variables) return vars;
+    if (!scope && !scope.variables) return vars;
 
     for (var i = 0; i < scope.variables.length; i++) {

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:127:9
 
 nodesbox.getVariables = function(scope) {
     var vars = [];
-    if (!scope || !scope.variables) return vars;
+    if (false) return vars;
 
     for (var i = 0; i < scope.variables.length; i++) {

[NoCoverage] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:129:21
     var vars = [];
     if (!scope || !scope.variables) return vars;
 
-    for (var i = 0; i < scope.variables.length; i++) {
+    for (var i = 0; false; i++) {
         vars.push(scope.variables[i]);
     }

[NoCoverage] UpdateOperator
malicious-updates-icse2021/permsystem/src/lib.js:129:49
     var vars = [];
     if (!scope || !scope.variables) return vars;
 
-    for (var i = 0; i < scope.variables.length; i++) {
+    for (var i = 0; i < scope.variables.length; i--) {
         vars.push(scope.variables[i]);
     }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:135:56
     return vars;
 }
 
-nodesbox.getVariablesFromUpperScopes = function(scope) {
-    var vars = [];
-    for (var i = 0; i < scope.variables.length; i++) {
-        vars.push(scope.variables[i]);
-    }
-    if (scope.upper) {
-        return vars.concat(nodesbox.getVariablesFromUpperScopes(scope.upper));
-    }
-    return vars.concat(nodesbox.getVariables(scope.upper));
-}
+nodesbox.getVariablesFromUpperScopes = function(scope) {}
 
 // transitive version

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:137:21
 
 nodesbox.getVariablesFromUpperScopes = function(scope) {
     var vars = [];
-    for (var i = 0; i < scope.variables.length; i++) {
+    for (var i = 0; false; i++) {
         vars.push(scope.variables[i]);
     }

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:137:21
 
 nodesbox.getVariablesFromUpperScopes = function(scope) {
     var vars = [];
-    for (var i = 0; i < scope.variables.length; i++) {
+    for (var i = 0; i <= scope.variables.length; i++) {
         vars.push(scope.variables[i]);
     }

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:140:9
     for (var i = 0; i < scope.variables.length; i++) {
         vars.push(scope.variables[i]);
     }
-    if (scope.upper) {
+    if (true) {
         return vars.concat(nodesbox.getVariablesFromUpperScopes(scope.upper));
     }

[Survived] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:140:22
     for (var i = 0; i < scope.variables.length; i++) {
         vars.push(scope.variables[i]);
     }
-    if (scope.upper) {
-        return vars.concat(nodesbox.getVariablesFromUpperScopes(scope.upper));
-    }
+    if (scope.upper) {}
     return vars.concat(nodesbox.getVariables(scope.upper));
 }

[NoCoverage] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:147:66
 }
 
 // transitive version
-nodesbox.getVariableDefinitionsFromUpperScopes = function(scope) {
-    var vars = [];
-    for (var i = 0; i < scope.variables.length; i++) {
-        if (scope.variables[i].defs[0] != undefined && scope.variables[i].defs[0].type === 'Variable') {
-            vars.push(scope.variables[i]);
-        }
-    }
-    if (scope.upper) {
-        return vars.concat(nodesbox.getVariableDefinitionsFromUpperScopes(scope.upper));
-    }
-    return vars.concat(nodesbox.getVariableDefinitions(scope.upper));
-}
+nodesbox.getVariableDefinitionsFromUpperScopes = function(scope) {}
 
 nodesbox.getVariableDefinitions = function(scope) {

[NoCoverage] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:149:21
 // transitive version
 nodesbox.getVariableDefinitionsFromUpperScopes = function(scope) {
     var vars = [];
-    for (var i = 0; i < scope.variables.length; i++) {
+    for (var i = 0; i >= scope.variables.length; i++) {
         if (scope.variables[i].defs[0] != undefined && scope.variables[i].defs[0].type === 'Variable') {
             vars.push(scope.variables[i]);

[NoCoverage] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:150:56
 nodesbox.getVariableDefinitionsFromUpperScopes = function(scope) {
     var vars = [];
     for (var i = 0; i < scope.variables.length; i++) {
-        if (scope.variables[i].defs[0] != undefined && scope.variables[i].defs[0].type === 'Variable') {
+        if (scope.variables[i].defs[0] != undefined && true) {
             vars.push(scope.variables[i]);
         }

[NoCoverage] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:150:56
 nodesbox.getVariableDefinitionsFromUpperScopes = function(scope) {
     var vars = [];
     for (var i = 0; i < scope.variables.length; i++) {
-        if (scope.variables[i].defs[0] != undefined && scope.variables[i].defs[0].type === 'Variable') {
+        if (scope.variables[i].defs[0] != undefined && false) {
             vars.push(scope.variables[i]);
         }

[NoCoverage] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:154:22
             vars.push(scope.variables[i]);
         }
     }
-    if (scope.upper) {
-        return vars.concat(nodesbox.getVariableDefinitionsFromUpperScopes(scope.upper));
-    }
+    if (scope.upper) {}
     return vars.concat(nodesbox.getVariableDefinitions(scope.upper));
 }

[NoCoverage] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:160:51
     return vars.concat(nodesbox.getVariableDefinitions(scope.upper));
 }
 
-nodesbox.getVariableDefinitions = function(scope) {
-    var vars = [];
-    for (var i = 0; i < scope.variables.length; i++) {
-        if (scope.variables[i].defs[0] != undefined && scope.variables[i].defs[0].type === 'Variable') {
-            vars.push(scope.variables[i]);
-        }
-    }
-    return vars;
-}
+nodesbox.getVariableDefinitions = function(scope) {}
 
 nodesbox.getFunctionDefinitions = function(scope) {

[NoCoverage] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:163:104
 nodesbox.getVariableDefinitions = function(scope) {
     var vars = [];
     for (var i = 0; i < scope.variables.length; i++) {
-        if (scope.variables[i].defs[0] != undefined && scope.variables[i].defs[0].type === 'Variable') {
-            vars.push(scope.variables[i]);
-        }
+        if (scope.variables[i].defs[0] != undefined && scope.variables[i].defs[0].type === 'Variable') {}
     }
     return vars;

[NoCoverage] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:170:51
     return vars;
 }
 
-nodesbox.getFunctionDefinitions = function(scope) {
-    var vars = [];
-    if (!scope || !scope.variables) return vars;
-
-    for (var i = 0; i < scope.variables.length; i++) {
-        if (scope.variables[i].defs[0].type === 'FunctionName') {
-            vars.push(scope.variables[i]);
-        }
-    }
-    return vars;
-}
+nodesbox.getFunctionDefinitions = function(scope) {}
 
 nodesbox.getImplicitVariables = function(scope) {

[NoCoverage] BooleanLiteral
malicious-updates-icse2021/permsystem/src/lib.js:172:19
 
 nodesbox.getFunctionDefinitions = function(scope) {
     var vars = [];
-    if (!scope || !scope.variables) return vars;
+    if (!scope || scope.variables) return vars;
 
     for (var i = 0; i < scope.variables.length; i++) {

[NoCoverage] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:174:54
     var vars = [];
     if (!scope || !scope.variables) return vars;
 
-    for (var i = 0; i < scope.variables.length; i++) {
-        if (scope.variables[i].defs[0].type === 'FunctionName') {
-            vars.push(scope.variables[i]);
-        }
-    }
+    for (var i = 0; i < scope.variables.length; i++) {}
     return vars;
 }

[NoCoverage] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:174:21
     var vars = [];
     if (!scope || !scope.variables) return vars;
 
-    for (var i = 0; i < scope.variables.length; i++) {
+    for (var i = 0; i <= scope.variables.length; i++) {
         if (scope.variables[i].defs[0].type === 'FunctionName') {
             vars.push(scope.variables[i]);

[NoCoverage] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:175:65
     if (!scope || !scope.variables) return vars;
 
     for (var i = 0; i < scope.variables.length; i++) {
-        if (scope.variables[i].defs[0].type === 'FunctionName') {
-            vars.push(scope.variables[i]);
-        }
+        if (scope.variables[i].defs[0].type === 'FunctionName') {}
     }
     return vars;

[NoCoverage] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:175:13
     if (!scope || !scope.variables) return vars;
 
     for (var i = 0; i < scope.variables.length; i++) {
-        if (scope.variables[i].defs[0].type === 'FunctionName') {
+        if (true) {
             vars.push(scope.variables[i]);
         }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:182:49
     return vars;
 }
 
-nodesbox.getImplicitVariables = function(scope) {
-    var vars = [];
-    for (var i = 0; i < scope.implicit.variables.length; i++) {
-        vars.push(scope.implicit.variables[i]);
-    }
-    return vars;
-}
+nodesbox.getImplicitVariables = function(scope) {}
 
 /*

[Survived] ArrayDeclaration
malicious-updates-icse2021/permsystem/src/lib.js:183:16
 }
 
 nodesbox.getImplicitVariables = function(scope) {
-    var vars = [];
+    var vars = ["Stryker was here"];
     for (var i = 0; i < scope.implicit.variables.length; i++) {
         vars.push(scope.implicit.variables[i]);

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:184:21
 
 nodesbox.getImplicitVariables = function(scope) {
     var vars = [];
-    for (var i = 0; i < scope.implicit.variables.length; i++) {
+    for (var i = 0; i <= scope.implicit.variables.length; i++) {
         vars.push(scope.implicit.variables[i]);
     }

[Timeout] UpdateOperator
malicious-updates-icse2021/permsystem/src/lib.js:184:58
 
 nodesbox.getImplicitVariables = function(scope) {
     var vars = [];
-    for (var i = 0; i < scope.implicit.variables.length; i++) {
+    for (var i = 0; i < scope.implicit.variables.length; i--) {
         vars.push(scope.implicit.variables[i]);
     }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:193:46
 /*
  *  Normalizing Member Access
  */
-nodesbox.normalizeMemberExpr = function(ast) {
-    var result = estraverse.replace(ast, {
-        enter: function(node) {
-            if (node.type === 'MemberExpression' && node.doNotRewrite != true) {
-                result = nodesbox.normalizeMemberExpression(node);
-                return result;
-            }
-        }
-    });
-    return result;
-}
+nodesbox.normalizeMemberExpr = function(ast) {}
 
 nodesbox.normalizeMemberExpression = function(node) {
