[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:195:31
  */
 nodesbox.normalizeMemberExpr = function(ast) {
     var result = estraverse.replace(ast, {
-        enter: function(node) {
-            if (node.type === 'MemberExpression' && node.doNotRewrite != true) {
-                result = nodesbox.normalizeMemberExpression(node);
-                return result;
-            }
-        }
+        enter: function(node) {}
     });
     return result;

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:196:17
 nodesbox.normalizeMemberExpr = function(ast) {
     var result = estraverse.replace(ast, {
         enter: function(node) {
-            if (node.type === 'MemberExpression' && node.doNotRewrite != true) {
+            if (false) {
                 result = nodesbox.normalizeMemberExpression(node);
                 return result;

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:196:17
 nodesbox.normalizeMemberExpr = function(ast) {
     var result = estraverse.replace(ast, {
         enter: function(node) {
-            if (node.type === 'MemberExpression' && node.doNotRewrite != true) {
+            if (false && node.doNotRewrite != true) {
                 result = nodesbox.normalizeMemberExpression(node);
                 return result;

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:205:53
     return result;
 }
 
-nodesbox.normalizeMemberExpression = function(node) {
-    var objectRef = node.object;
-    let propertyName;
-    if (node.property.type === 'Identifier') propertyName = node.property.name;
-    if (node.property.type === 'Literal') propertyName = node.property.value;
-    if (nodesbox.isBlacklistedProperty(propertyName)) {
-        return nodesbox.genNormalizedMemberExprForLiteral(objectRef, propertyName);
-    }
-    return node;
-}
+nodesbox.normalizeMemberExpression = function(node) {}
 
 nodesbox.genNormalizedMemberExprForLiteral = function(objectRef, propertyName) {

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:208:9
 nodesbox.normalizeMemberExpression = function(node) {
     var objectRef = node.object;
     let propertyName;
-    if (node.property.type === 'Identifier') propertyName = node.property.name;
+    if (node.property.type !== 'Identifier') propertyName = node.property.name;
     if (node.property.type === 'Literal') propertyName = node.property.value;
     if (nodesbox.isBlacklistedProperty(propertyName)) {

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:208:9
 nodesbox.normalizeMemberExpression = function(node) {
     var objectRef = node.object;
     let propertyName;
-    if (node.property.type === 'Identifier') propertyName = node.property.name;
+    if (false) propertyName = node.property.name;
     if (node.property.type === 'Literal') propertyName = node.property.value;
     if (nodesbox.isBlacklistedProperty(propertyName)) {

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:209:9
     var objectRef = node.object;
     let propertyName;
     if (node.property.type === 'Identifier') propertyName = node.property.name;
-    if (node.property.type === 'Literal') propertyName = node.property.value;
+    if (node.property.type !== 'Literal') propertyName = node.property.value;
     if (nodesbox.isBlacklistedProperty(propertyName)) {
         return nodesbox.genNormalizedMemberExprForLiteral(objectRef, propertyName);

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:209:9
     var objectRef = node.object;
     let propertyName;
     if (node.property.type === 'Identifier') propertyName = node.property.name;
-    if (node.property.type === 'Literal') propertyName = node.property.value;
+    if (true) propertyName = node.property.value;
     if (nodesbox.isBlacklistedProperty(propertyName)) {
         return nodesbox.genNormalizedMemberExprForLiteral(objectRef, propertyName);

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:210:55
     let propertyName;
     if (node.property.type === 'Identifier') propertyName = node.property.name;
     if (node.property.type === 'Literal') propertyName = node.property.value;
-    if (nodesbox.isBlacklistedProperty(propertyName)) {
-        return nodesbox.genNormalizedMemberExprForLiteral(objectRef, propertyName);
-    }
+    if (nodesbox.isBlacklistedProperty(propertyName)) {}
     return node;
 }

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:210:9
     let propertyName;
     if (node.property.type === 'Identifier') propertyName = node.property.name;
     if (node.property.type === 'Literal') propertyName = node.property.value;
-    if (nodesbox.isBlacklistedProperty(propertyName)) {
+    if (false) {
         return nodesbox.genNormalizedMemberExprForLiteral(objectRef, propertyName);
     }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:216:80
     return node;
 }
 
-nodesbox.genNormalizedMemberExprForLiteral = function(objectRef, propertyName) {
-    var newNode = {};
-    newNode.type = 'MemberExpression';
-    newNode.property = { type: 'Literal', value: propertyName };
-    setObjectReferenceOnNewNode(objectRef, newNode);
-    newNode.computed = true;
-    return newNode;
-}
+nodesbox.genNormalizedMemberExprForLiteral = function(objectRef, propertyName) {}
 
 nodesbox.genNormalizedMemberExprForIdentifier = function(objectRef, propertyName, isLiteral) {

[Killed] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:219:32
 nodesbox.genNormalizedMemberExprForLiteral = function(objectRef, propertyName) {
     var newNode = {};
     newNode.type = 'MemberExpression';
-    newNode.property = { type: 'Literal', value: propertyName };
+    newNode.property = { type: "", value: propertyName };
     setObjectReferenceOnNewNode(objectRef, newNode);
     newNode.computed = true;

[Killed] BooleanLiteral
malicious-updates-icse2021/permsystem/src/lib.js:221:24
     newNode.type = 'MemberExpression';
     newNode.property = { type: 'Literal', value: propertyName };
     setObjectReferenceOnNewNode(objectRef, newNode);
-    newNode.computed = true;
+    newNode.computed = false;
     return newNode;
 }

[NoCoverage] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:225:94
     return newNode;
 }
 
-nodesbox.genNormalizedMemberExprForIdentifier = function(objectRef, propertyName, isLiteral) {
-    var newNode = {};
-    newNode.type = 'MemberExpression';
-    newNode.property = propertyName;
-    setObjectReferenceOnNewNode(objectRef, newNode);
-    newNode.computed = true;
-    return newNode;
-}
+nodesbox.genNormalizedMemberExprForIdentifier = function(objectRef, propertyName, isLiteral) {}
 
 nodesbox.genNewMemberExpr = function(objectName, propertyName) {

[NoCoverage] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:227:20
 
 nodesbox.genNormalizedMemberExprForIdentifier = function(objectRef, propertyName, isLiteral) {
     var newNode = {};
-    newNode.type = 'MemberExpression';
+    newNode.type = "";
     newNode.property = propertyName;
     setObjectReferenceOnNewNode(objectRef, newNode);

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:234:64
     return newNode;
 }
 
-nodesbox.genNewMemberExpr = function(objectName, propertyName) {
-    var newNode = {};
-    newNode.type = 'MemberExpression';
-    newNode.object = { type: 'Identifier', name: objectName };
-    newNode.property = { type: 'Literal', value: propertyName };
-    newNode.rewrite =
-    newNode.computed = true;
-    return newNode;
-}
+nodesbox.genNewMemberExpr = function(objectName, propertyName) {}
 
 nodesbox.rewriteMemberExpr = function(ast, propCheckFunctionName) {

[Killed] BooleanLiteral
malicious-updates-icse2021/permsystem/src/lib.js:240:24
     newNode.object = { type: 'Identifier', name: objectName };
     newNode.property = { type: 'Literal', value: propertyName };
     newNode.rewrite =
-    newNode.computed = true;
+    newNode.computed = false;
     return newNode;
 }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:244:67
     return newNode;
 }
 
-nodesbox.rewriteMemberExpr = function(ast, propCheckFunctionName) {
-    var result = estraverse.replace(ast, {
-        enter: function(node) {
-            if (node.type === 'MemberExpression' && node.doNotRewrite != true) {
-                result = nodesbox.rewritePropAccess(node, propCheckFunctionName);
-                return result;
-            }
-        }
-    });
-    return result;
-}
+nodesbox.rewriteMemberExpr = function(ast, propCheckFunctionName) {}
 
 nodesbox.rewritePropAccess = function(node, propCheckFunctionName) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:246:31
 
 nodesbox.rewriteMemberExpr = function(ast, propCheckFunctionName) {
     var result = estraverse.replace(ast, {
-        enter: function(node) {
-            if (node.type === 'MemberExpression' && node.doNotRewrite != true) {
-                result = nodesbox.rewritePropAccess(node, propCheckFunctionName);
-                return result;
-            }
-        }
+        enter: function(node) {}
     });
     return result;

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:256:68
     return result;
 }
 
-nodesbox.rewritePropAccess = function(node, propCheckFunctionName) {
-    var objectRef = node.object;
-    var propertyName = "undefined";
-
-    if (node.property.type === 'Literal') {
-        propertyName = node.property.value;
-        if (nodesbox.isBlacklistedProperty(propertyName)) {
-            return nodesbox.genPropAccessFunctionCallForLiteral(objectRef, propertyName, propCheckFunctionName);
-        }
-        return node;
-    }
-    else if (node.property.type === 'Identifier') {
-        if (nodesbox.isBlacklistedProperty(propertyName)) {
-            propertyName = node.property.name;
-            return nodesbox.genPropAccessFunctionCallForIdentifier(objectRef, propertyName, propCheckFunctionName);
-        }
-    } else {
-        propertyName = node.property;
-        return nodesbox.genPropAccessFunctionCallForIdentifier(objectRef, propertyName, propCheckFunctionName);
-    }
-    return node;
-}
+nodesbox.rewritePropAccess = function(node, propCheckFunctionName) {}
 
 nodesbox.genPropAccessFunctionCallForIdentifier = function(objectRef, propertyName, propCheckFunctionName) {

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:260:9
     var objectRef = node.object;
     var propertyName = "undefined";
 
-    if (node.property.type === 'Literal') {
+    if (false) {
         propertyName = node.property.value;
         if (nodesbox.isBlacklistedProperty(propertyName)) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:260:43
     var objectRef = node.object;
     var propertyName = "undefined";
 
-    if (node.property.type === 'Literal') {
-        propertyName = node.property.value;
-        if (nodesbox.isBlacklistedProperty(propertyName)) {
-            return nodesbox.genPropAccessFunctionCallForLiteral(objectRef, propertyName, propCheckFunctionName);
-        }
-        return node;
-    }
+    if (node.property.type === 'Literal') {}
     else if (node.property.type === 'Identifier') {
         if (nodesbox.isBlacklistedProperty(propertyName)) {

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:262:13
 
     if (node.property.type === 'Literal') {
         propertyName = node.property.value;
-        if (nodesbox.isBlacklistedProperty(propertyName)) {
+        if (true) {
             return nodesbox.genPropAccessFunctionCallForLiteral(objectRef, propertyName, propCheckFunctionName);
         }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:262:59
 
     if (node.property.type === 'Literal') {
         propertyName = node.property.value;
-        if (nodesbox.isBlacklistedProperty(propertyName)) {
-            return nodesbox.genPropAccessFunctionCallForLiteral(objectRef, propertyName, propCheckFunctionName);
-        }
+        if (nodesbox.isBlacklistedProperty(propertyName)) {}
         return node;
     }

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:267:14
         }
         return node;
     }
-    else if (node.property.type === 'Identifier') {
+    else if (false) {
         if (nodesbox.isBlacklistedProperty(propertyName)) {
             propertyName = node.property.name;

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:267:14
         }
         return node;
     }
-    else if (node.property.type === 'Identifier') {
+    else if (node.property.type !== 'Identifier') {
         if (nodesbox.isBlacklistedProperty(propertyName)) {
             propertyName = node.property.name;

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:268:13
         return node;
     }
     else if (node.property.type === 'Identifier') {
-        if (nodesbox.isBlacklistedProperty(propertyName)) {
+        if (true) {
             propertyName = node.property.name;
             return nodesbox.genPropAccessFunctionCallForIdentifier(objectRef, propertyName, propCheckFunctionName);

[NoCoverage] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:268:59
         return node;
     }
     else if (node.property.type === 'Identifier') {
-        if (nodesbox.isBlacklistedProperty(propertyName)) {
-            propertyName = node.property.name;
-            return nodesbox.genPropAccessFunctionCallForIdentifier(objectRef, propertyName, propCheckFunctionName);
-        }
+        if (nodesbox.isBlacklistedProperty(propertyName)) {}
     } else {
         propertyName = node.property;

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:272:12
             propertyName = node.property.name;
             return nodesbox.genPropAccessFunctionCallForIdentifier(objectRef, propertyName, propCheckFunctionName);
         }
-    } else {
-        propertyName = node.property;
-        return nodesbox.genPropAccessFunctionCallForIdentifier(objectRef, propertyName, propCheckFunctionName);
-    }
+    } else {}
     return node;
 }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:279:108
     return node;
 }
 
-nodesbox.genPropAccessFunctionCallForIdentifier = function(objectRef, propertyName, propCheckFunctionName) {
-    var newNode = {};
-    newNode.type = 'CallExpression';
-    newNode.callee = { type: 'Identifier', name: propCheckFunctionName };
-    newNode.arguments = [];
-    newNode.arguments[0] = objectRef;
-    newNode.arguments[1] = propertyName;
-    return newNode;
-}
+nodesbox.genPropAccessFunctionCallForIdentifier = function(objectRef, propertyName, propCheckFunctionName) {}
 
 nodesbox.genPropAccessFunctionCallForLiteral = function(objectRef, propertyName, propCheckFunctionName) {

[Killed] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:281:20
 
 nodesbox.genPropAccessFunctionCallForIdentifier = function(objectRef, propertyName, propCheckFunctionName) {
     var newNode = {};
-    newNode.type = 'CallExpression';
+    newNode.type = "";
     newNode.callee = { type: 'Identifier', name: propCheckFunctionName };
     newNode.arguments = [];

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:289:105
     return newNode;
 }
 
-nodesbox.genPropAccessFunctionCallForLiteral = function(objectRef, propertyName, propCheckFunctionName) {
-    var newNode = {};
-    newNode.type = 'CallExpression';
-    newNode.callee = { type: 'Identifier', name: propCheckFunctionName };
-    newNode.arguments = [];
-    newNode.arguments[0] = objectRef;
-    newNode.arguments[1] = { type: 'Literal', value: propertyName };
-    return newNode;
-}
+nodesbox.genPropAccessFunctionCallForLiteral = function(objectRef, propertyName, propCheckFunctionName) {}
 
 nodesbox.normalizeVariablesScope = function(ast, scopeManager) {

[Killed] ObjectLiteral
malicious-updates-icse2021/permsystem/src/lib.js:292:22
 nodesbox.genPropAccessFunctionCallForLiteral = function(objectRef, propertyName, propCheckFunctionName) {
     var newNode = {};
     newNode.type = 'CallExpression';
-    newNode.callee = { type: 'Identifier', name: propCheckFunctionName };
+    newNode.callee = {};
     newNode.arguments = [];
     newNode.arguments[0] = objectRef;

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:299:64
     return newNode;
 }
 
-nodesbox.normalizeVariablesScope = function(ast, scopeManager) {
-    for (var i = 0; i < scopeManager.scopes.length; i++) {
-        var scope = scopeManager.scopes[i];
-        var references = nodesbox.getReferences(scope);
-        var variables = nodesbox.getVariablesFromUpperScopes(scope);
-
-        if (scope.type == 'global') {
-            var implicitVariables = nodesbox.getImplicitVariables(scope);
-            for (var k = references.length - 1; k >= 0; k--) {
-                nodesbox.rewriteVariableReferencesOnGlobalScope(references[k].identifier, variables);
-            }
-        } else {
-            for (var k = references.length - 1; k >= 0; k--) {
-                nodesbox.rewriteVariableReferences(references[k].identifier, variables, implicitVariables);
-            }
-        }
-    }
-    return ast;
-}
+nodesbox.normalizeVariablesScope = function(ast, scopeManager) {}
 
 nodesbox.rewriteVariableReferencesOnGlobalScope = function(node, variables) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:300:58
 }
 
 nodesbox.normalizeVariablesScope = function(ast, scopeManager) {
-    for (var i = 0; i < scopeManager.scopes.length; i++) {
-        var scope = scopeManager.scopes[i];
-        var references = nodesbox.getReferences(scope);
-        var variables = nodesbox.getVariablesFromUpperScopes(scope);
-
-        if (scope.type == 'global') {
-            var implicitVariables = nodesbox.getImplicitVariables(scope);
-            for (var k = references.length - 1; k >= 0; k--) {
-                nodesbox.rewriteVariableReferencesOnGlobalScope(references[k].identifier, variables);
-            }
-        } else {
-            for (var k = references.length - 1; k >= 0; k--) {
-                nodesbox.rewriteVariableReferences(references[k].identifier, variables, implicitVariables);
-            }
-        }
-    }
+    for (var i = 0; i < scopeManager.scopes.length; i++) {}
     return ast;
 }

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:300:21
 }
 
 nodesbox.normalizeVariablesScope = function(ast, scopeManager) {
-    for (var i = 0; i < scopeManager.scopes.length; i++) {
+    for (var i = 0; false; i++) {
         var scope = scopeManager.scopes[i];
         var references = nodesbox.getReferences(scope);

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:305:13
         var references = nodesbox.getReferences(scope);
         var variables = nodesbox.getVariablesFromUpperScopes(scope);
 
-        if (scope.type == 'global') {
+        if (true) {
             var implicitVariables = nodesbox.getImplicitVariables(scope);
             for (var k = references.length - 1; k >= 0; k--) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:305:37
         var references = nodesbox.getReferences(scope);
         var variables = nodesbox.getVariablesFromUpperScopes(scope);
 
-        if (scope.type == 'global') {
-            var implicitVariables = nodesbox.getImplicitVariables(scope);
-            for (var k = references.length - 1; k >= 0; k--) {
-                nodesbox.rewriteVariableReferencesOnGlobalScope(references[k].identifier, variables);
-            }
-        } else {
+        if (scope.type == 'global') {} else {
             for (var k = references.length - 1; k >= 0; k--) {
                 nodesbox.rewriteVariableReferences(references[k].identifier, variables, implicitVariables);

[Killed] UpdateOperator
malicious-updates-icse2021/permsystem/src/lib.js:307:57
 
         if (scope.type == 'global') {
             var implicitVariables = nodesbox.getImplicitVariables(scope);
-            for (var k = references.length - 1; k >= 0; k--) {
+            for (var k = references.length - 1; k >= 0; k++) {
                 nodesbox.rewriteVariableReferencesOnGlobalScope(references[k].identifier, variables);
             }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:307:62
 
         if (scope.type == 'global') {
             var implicitVariables = nodesbox.getImplicitVariables(scope);
-            for (var k = references.length - 1; k >= 0; k--) {
-                nodesbox.rewriteVariableReferencesOnGlobalScope(references[k].identifier, variables);
-            }
+            for (var k = references.length - 1; k >= 0; k--) {}
         } else {
             for (var k = references.length - 1; k >= 0; k--) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:310:16
             for (var k = references.length - 1; k >= 0; k--) {
                 nodesbox.rewriteVariableReferencesOnGlobalScope(references[k].identifier, variables);
             }
-        } else {
-            for (var k = references.length - 1; k >= 0; k--) {
-                nodesbox.rewriteVariableReferences(references[k].identifier, variables, implicitVariables);
-            }
-        }
+        } else {}
     }
     return ast;

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:311:62
                 nodesbox.rewriteVariableReferencesOnGlobalScope(references[k].identifier, variables);
             }
         } else {
-            for (var k = references.length - 1; k >= 0; k--) {
-                nodesbox.rewriteVariableReferences(references[k].identifier, variables, implicitVariables);
-            }
+            for (var k = references.length - 1; k >= 0; k--) {}
         }
     }

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:311:49
                 nodesbox.rewriteVariableReferencesOnGlobalScope(references[k].identifier, variables);
             }
         } else {
-            for (var k = references.length - 1; k >= 0; k--) {
+            for (var k = references.length - 1; false; k--) {
                 nodesbox.rewriteVariableReferences(references[k].identifier, variables, implicitVariables);
             }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:319:77
     return ast;
 }
 
-nodesbox.rewriteVariableReferencesOnGlobalScope = function(node, variables) {
-    var definedVariableNames = variables.map(x => x.name);
-    var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
-    var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;
-
-    var variableName = node.name;
-    //replace references to global variables
-    if (isDefinedLocally || !isLocalObject) {
-        if (node.parent) {
-            var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
-            for (var i = parentKeys.length - 1; i >= 0; i--) {
-                if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
-                    node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);
-                }
-            }
-        }
-    }
-    return node;
-}
+nodesbox.rewriteVariableReferencesOnGlobalScope = function(node, variables) {}
 
 nodesbox.rewriteVariableReferences = function(node, variables, implicitVariables) {

[Survived] ArrowFunction
malicious-updates-icse2021/permsystem/src/lib.js:320:46
 }
 
 nodesbox.rewriteVariableReferencesOnGlobalScope = function(node, variables) {
-    var definedVariableNames = variables.map(x => x.name);
+    var definedVariableNames = variables.map(() => undefined);
     var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
     var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:321:28
 
 nodesbox.rewriteVariableReferencesOnGlobalScope = function(node, variables) {
     var definedVariableNames = variables.map(x => x.name);
-    var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
+    var isDefinedLocally = true;
     var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;
 

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:321:28
 
 nodesbox.rewriteVariableReferencesOnGlobalScope = function(node, variables) {
     var definedVariableNames = variables.map(x => x.name);
-    var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
+    var isDefinedLocally = definedVariableNames.indexOf(node.name) <= -1;
     var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;
 

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:322:25
 nodesbox.rewriteVariableReferencesOnGlobalScope = function(node, variables) {
     var definedVariableNames = variables.map(x => x.name);
     var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
-    var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;
+    var isLocalObject = nodesbox.localVariables.indexOf(node.name) >= -1;
 
     var variableName = node.name;

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:322:25
 nodesbox.rewriteVariableReferencesOnGlobalScope = function(node, variables) {
     var definedVariableNames = variables.map(x => x.name);
     var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
-    var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;
+    var isLocalObject = false;
 
     var variableName = node.name;

[Killed] LogicalOperator
malicious-updates-icse2021/permsystem/src/lib.js:326:9
 
     var variableName = node.name;
     //replace references to global variables
-    if (isDefinedLocally || !isLocalObject) {
+    if (isDefinedLocally && !isLocalObject) {
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:326:9
 
     var variableName = node.name;
     //replace references to global variables
-    if (isDefinedLocally || !isLocalObject) {
+    if (true) {
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:327:13
     var variableName = node.name;
     //replace references to global variables
     if (isDefinedLocally || !isLocalObject) {
-        if (node.parent) {
+        if (false) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
             for (var i = parentKeys.length - 1; i >= 0; i--) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:327:26
     var variableName = node.name;
     //replace references to global variables
     if (isDefinedLocally || !isLocalObject) {
-        if (node.parent) {
-            var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
-            for (var i = parentKeys.length - 1; i >= 0; i--) {
-                if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
-                    node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);
-                }
-            }
-        }
+        if (node.parent) {}
     }
     return node;

[Killed] ArrowFunction
malicious-updates-icse2021/permsystem/src/lib.js:328:62
     //replace references to global variables
     if (isDefinedLocally || !isLocalObject) {
         if (node.parent) {
-            var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
+            var parentKeys = Object.keys(node.parent).filter(() => undefined);
             for (var i = parentKeys.length - 1; i >= 0; i--) {
                 if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:328:67
     //replace references to global variables
     if (isDefinedLocally || !isLocalObject) {
         if (node.parent) {
-            var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
+            var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) >= 0);
             for (var i = parentKeys.length - 1; i >= 0; i--) {
                 if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:329:62
     if (isDefinedLocally || !isLocalObject) {
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
-            for (var i = parentKeys.length - 1; i >= 0; i--) {
-                if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
-                    node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);
-                }
-            }
+            for (var i = parentKeys.length - 1; i >= 0; i--) {}
         }
     }
