[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:329:49
     if (isDefinedLocally || !isLocalObject) {
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
-            for (var i = parentKeys.length - 1; i >= 0; i--) {
+            for (var i = parentKeys.length - 1; i < 0; i--) {
                 if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
                     node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:330:60
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
             for (var i = parentKeys.length - 1; i >= 0; i--) {
-                if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
+                if (node.parent[parentKeys[i]] === node && node.doNotRewrite == true) {
                     node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);
                 }

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:330:21
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
             for (var i = parentKeys.length - 1; i >= 0; i--) {
-                if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
+                if (true) {
                     node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);
                 }

[Killed] StringLiteral
malicious-updates-icse2021/permsystem/src/lib.js:331:76
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
             for (var i = parentKeys.length - 1; i >= 0; i--) {
                 if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
-                    node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);
+                    node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("", variableName);
                 }
             }

[Survived] ArrowFunction
malicious-updates-icse2021/permsystem/src/lib.js:340:56
 }
 
 nodesbox.rewriteVariableReferences = function(node, variables, implicitVariables) {
-    var implicitVariablesNames = implicitVariables.map(x => x.name);
+    var implicitVariablesNames = implicitVariables.map(() => undefined);
     var definedVariableNames = variables.map(x => x.name);
 

[Killed] ArrowFunction
malicious-updates-icse2021/permsystem/src/lib.js:341:46
 
 nodesbox.rewriteVariableReferences = function(node, variables, implicitVariables) {
     var implicitVariablesNames = implicitVariables.map(x => x.name);
-    var definedVariableNames = variables.map(x => x.name);
+    var definedVariableNames = variables.map(() => undefined);
 
     var implicitVariable = implicitVariablesNames.indexOf(node.name) > -1;

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:343:28
     var implicitVariablesNames = implicitVariables.map(x => x.name);
     var definedVariableNames = variables.map(x => x.name);
 
-    var implicitVariable = implicitVariablesNames.indexOf(node.name) > -1;
+    var implicitVariable = implicitVariablesNames.indexOf(node.name) <= -1;
     var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
     var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:343:28
     var implicitVariablesNames = implicitVariables.map(x => x.name);
     var definedVariableNames = variables.map(x => x.name);
 
-    var implicitVariable = implicitVariablesNames.indexOf(node.name) > -1;
+    var implicitVariable = implicitVariablesNames.indexOf(node.name) >= -1;
     var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
     var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:344:28
     var definedVariableNames = variables.map(x => x.name);
 
     var implicitVariable = implicitVariablesNames.indexOf(node.name) > -1;
-    var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
+    var isDefinedLocally = true;
     var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;
 

[Killed] UnaryOperator
malicious-updates-icse2021/permsystem/src/lib.js:344:70
     var definedVariableNames = variables.map(x => x.name);
 
     var implicitVariable = implicitVariablesNames.indexOf(node.name) > -1;
-    var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
+    var isDefinedLocally = definedVariableNames.indexOf(node.name) > +1;
     var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;
 

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:345:25
 
     var implicitVariable = implicitVariablesNames.indexOf(node.name) > -1;
     var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
-    var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;
+    var isLocalObject = true;
 
     // replace references to implicit variable 'x' to global.x

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:345:25
 
     var implicitVariable = implicitVariablesNames.indexOf(node.name) > -1;
     var isDefinedLocally = definedVariableNames.indexOf(node.name) > -1;
-    var isLocalObject = nodesbox.localVariables.indexOf(node.name) > -1;
+    var isLocalObject = nodesbox.localVariables.indexOf(node.name) <= -1;
 
     // replace references to implicit variable 'x' to global.x

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:349:9
 
     // replace references to implicit variable 'x' to global.x
     var variableName = node.name;
-    if (implicitVariable) {
+    if (true) {
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);

[Survived] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:349:9
 
     // replace references to implicit variable 'x' to global.x
     var variableName = node.name;
-    if (implicitVariable) {
+    if (false) {
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);

[Survived] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:350:13
     // replace references to implicit variable 'x' to global.x
     var variableName = node.name;
     if (implicitVariable) {
-        if (node.parent) {
+        if (false) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
             for (var i = parentKeys.length - 1; i >= 0; i--) {

[Survived] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:350:13
     // replace references to implicit variable 'x' to global.x
     var variableName = node.name;
     if (implicitVariable) {
-        if (node.parent) {
+        if (true) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
             for (var i = parentKeys.length - 1; i >= 0; i--) {

[Survived] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:351:67
     var variableName = node.name;
     if (implicitVariable) {
         if (node.parent) {
-            var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
+            var parentKeys = Object.keys(node.parent).filter(x => true);
             for (var i = parentKeys.length - 1; i >= 0; i--) {
                 if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {

[Survived] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:352:49
     if (implicitVariable) {
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
-            for (var i = parentKeys.length - 1; i >= 0; i--) {
+            for (var i = parentKeys.length - 1; false; i--) {
                 if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
                     node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:353:21
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
             for (var i = parentKeys.length - 1; i >= 0; i--) {
-                if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
+                if (true && node.doNotRewrite != true) {
                     node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);
                 }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:361:46
 
     }
     // replace references to non-local variables
-    if (!isDefinedLocally && !isLocalObject) {
-        if (node.parent) {
-            var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
-            for (var i = parentKeys.length - 1; i >= 0; i--) {
-                if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
-                    node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);
-                }
-            }
-        }
-
-    }
+    if (!isDefinedLocally && !isLocalObject) {}
     return node;
 }

[Killed] LogicalOperator
malicious-updates-icse2021/permsystem/src/lib.js:361:9
 
     }
     // replace references to non-local variables
-    if (!isDefinedLocally && !isLocalObject) {
+    if (!isDefinedLocally || !isLocalObject) {
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:362:26
     }
     // replace references to non-local variables
     if (!isDefinedLocally && !isLocalObject) {
-        if (node.parent) {
-            var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
-            for (var i = parentKeys.length - 1; i >= 0; i--) {
-                if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
-                    node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);
-                }
-            }
-        }
+        if (node.parent) {}
 
     }

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:362:13
     }
     // replace references to non-local variables
     if (!isDefinedLocally && !isLocalObject) {
-        if (node.parent) {
+        if (false) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
             for (var i = parentKeys.length - 1; i >= 0; i--) {

[Killed] ConditionalExpression
malicious-updates-icse2021/permsystem/src/lib.js:363:67
     // replace references to non-local variables
     if (!isDefinedLocally && !isLocalObject) {
         if (node.parent) {
-            var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
+            var parentKeys = Object.keys(node.parent).filter(x => false);
             for (var i = parentKeys.length - 1; i >= 0; i--) {
                 if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {

[Killed] LogicalOperator
malicious-updates-icse2021/permsystem/src/lib.js:365:21
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
             for (var i = parentKeys.length - 1; i >= 0; i--) {
-                if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
+                if (node.parent[parentKeys[i]] === node || node.doNotRewrite != true) {
                     node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);
                 }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:365:87
         if (node.parent) {
             var parentKeys = Object.keys(node.parent).filter(x => internalObjectKeys.indexOf(x) < 0);
             for (var i = parentKeys.length - 1; i >= 0; i--) {
-                if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {
-                    node.parent[parentKeys[i]] = nodesbox.genNewMemberExpr("global", variableName);
-                }
+                if (node.parent[parentKeys[i]] === node && node.doNotRewrite != true) {}
             }
         }

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:375:34
     return node;
 }
 
-nodesbox.genCode = function(ast) {
-    return escodegen.generate(ast);
-}
+nodesbox.genCode = function(ast) {}
 
 function setObjectReferenceOnNewNode(objectRef, newNode) {

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:379:58
     return escodegen.generate(ast);
 }
 
-function setObjectReferenceOnNewNode(objectRef, newNode) {
-    if (objectRef.type === 'Identifier') {
-        newNode.object = { type: 'Identifier', name: objectRef.name };
-    } else {
-        newNode.object = objectRef;
-    }
-}
+function setObjectReferenceOnNewNode(objectRef, newNode) {}
 
 

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:380:42
 }
 
 function setObjectReferenceOnNewNode(objectRef, newNode) {
-    if (objectRef.type === 'Identifier') {
-        newNode.object = { type: 'Identifier', name: objectRef.name };
-    } else {
+    if (objectRef.type === 'Identifier') {} else {
         newNode.object = objectRef;
     }

[Killed] EqualityOperator
malicious-updates-icse2021/permsystem/src/lib.js:380:9
 }
 
 function setObjectReferenceOnNewNode(objectRef, newNode) {
-    if (objectRef.type === 'Identifier') {
+    if (objectRef.type !== 'Identifier') {
         newNode.object = { type: 'Identifier', name: objectRef.name };
     } else {

[Killed] ObjectLiteral
malicious-updates-icse2021/permsystem/src/lib.js:381:26
 
 function setObjectReferenceOnNewNode(objectRef, newNode) {
     if (objectRef.type === 'Identifier') {
-        newNode.object = { type: 'Identifier', name: objectRef.name };
+        newNode.object = {};
     } else {
         newNode.object = objectRef;

[Killed] BlockStatement
malicious-updates-icse2021/permsystem/src/lib.js:382:12
 function setObjectReferenceOnNewNode(objectRef, newNode) {
     if (objectRef.type === 'Identifier') {
         newNode.object = { type: 'Identifier', name: objectRef.name };
-    } else {
-        newNode.object = objectRef;
-    }
+    } else {}
 }
 
