[NoCoverage] ConditionalExpression
malicious-updates-icse2021/permsystem/src/rewrite.js:2:5
 var nodesbox = require('./lib');
-if (process.argv.length != 3)
+if (true)
 	throw Error("Illegal number of arguments. Usage: node rewrite.js [inputFile] [outputFile]");
 

[NoCoverage] ConditionalExpression
malicious-updates-icse2021/permsystem/src/rewrite.js:2:5
 var nodesbox = require('./lib');
-if (process.argv.length != 3)
+if (false)
 	throw Error("Illegal number of arguments. Usage: node rewrite.js [inputFile] [outputFile]");
 
